var store = [{
        "title": "מהי Java",
        "excerpt":"שימו לב - העשרה פוסט זה הוא העשרה בנושא שאני מקווה שהוא מעניין ומוסיף עניין, אבל החומר בו הוא כנראה לא קריטי לתכנות שאנחנו עוסקים בו, ולא כזה שלא ניתן להבין את שאר החומר בלעדיו. למה צריך את Java אנחנו רוצים לכתוב תוכנות - דברים שהמחשב יכול להריץ. המחשב, כידוע...","categories": ["תכנות בכללי","מבוא","Java בכללי"],
        "tags": ["שפה אוניברסלית","קומפילציה","JVM"],
        "url": "/2023/09/28/what-is-java/",
        "teaser": null
      },{
        "title": "התחלת העבודה עם Java",
        "excerpt":"בדרך כלל, הדבר הראשון שעושים כשלומדים שפת תכנות הוא ללמוד איך לכתוב תוכנית שכותבת למסך את המילים “Hello, world!” - הדבר כל כך נפוץ שיש לזה שם, זה נקרא תוכנית \"שלום עולם\". למה להתחיל מלכתוב למסך? כי לרוב זה הקל ביותר; למה “Hello, world!”? כנראה סיבות היסטוריות כלשהן. בכל מקרה,...","categories": ["Java בסיסית","טכני"],
        "tags": ["חבילות","מחלקות","פונקציות","קבצים","חוקי שמות"],
        "url": "/2023/09/29/java-structure/",
        "teaser": null
      },{
        "title": "עכשיו באמת מתחילים - פלט ב-Java",
        "excerpt":"אנחנו מתחילים ללמוד את שפת התכנות Java. מטרתנו היום היא להבין איך לבצע כמה דברים בסיסיים בג’אווה, ולהבין איך נראה קוד פשוט בשפה. צ’אט עם המחשב דיברתי על זה קצת גם בפוסט הקודם: פעם, מזמן, המחשב לא סיפק לנו ממשק שהוא ויזואלי באותה מידה שהוא היום. פעם, כל מה שהיה...","categories": ["צעדים ראשונים בג'אווה"],
        "tags": ["פלט"],
        "url": "/2023/10/01/output/",
        "teaser": null
      },{
        "title": "קומנטים (הערות, תגובות)",
        "excerpt":"כפי ששמתן לב, Java, כשפת תכנות, היא אמנם לא שפת מכונה בינארית, אבל היא גם לא בדיוק שפה אנושית מדוברת (אגב, אין להתבלבל בין שפת התכנות Java לבין שפה אנושית שגם לה קוראים Java שמדברים באי באינדונזיה שנקרא ג’אווה או יאווה). אנחנו עדיין לא יכולים למחשב קוד באנגלית (וכן, אני...","categories": ["צעדים ראשונים בג'אווה"],
        "tags": ["קומנטים","תיעוד"],
        "url": "/2023/10/02/comments/",
        "teaser": null
      },{
        "title": "משתנים",
        "excerpt":"משתנים הם מהכלים השימושיים ביותר ברוב שפות התכנות. משתנים מאפשרים לנו לעבוד עם נתונים ולעבוד איתם. “נתונים” אולי נשמע כמו משהו שרק מתכנתים שעוסקים בסטטיסטיקות צריכים לעבוד איתו, אבל “נתונים” זה דבר הרבה יותר רחב - “נתונים” עבורנו זה גם “האם הנהגת בדיוק לחצה על הכפתור בג’וסיטיק שלה שאמור לגרום...","categories": ["צעדים ראשונים ב-Java"],
        "tags": ["משתנים","הצהרה","טיפוסים"],
        "url": "/2023/10/03/variables/",
        "teaser": null
      },{
        "title": "final וקבועים",
        "excerpt":"final לאחר הפוסט הקודם על משתנים, אני רוצה להוסיף דבר קטן שבדרך כלל לא מלמדים בנקודה הזו, אבל אני מתחיל לחשוב שיכול להיות שימושי לראות כבר עכשיו. זו נקודה קטנה ולא מאוד מסובכת, והיא לפעמים מופיעה בהמשך בלי הסבר. כאשר מצהירים על משתנה ב-Java, ניתן לסמן את המילה final לפני...","categories": ["צעדים ראשונים בג'אווה"],
        "tags": ["משתנים","טיפוסים","final","קבועים","מספרי קסם"],
        "url": "/2023/10/04/final/",
        "teaser": null
      },{
        "title": "קאסטינג",
        "excerpt":"⚠ שימו לב - העמקה זהו מסוגי הפוסטים שבהם אני נכנס מאוד לעומק בנושא שבדרך כלל אני עובר עליו מהר כשאני מעביר שיעורים פרונטליים. בדרך כלל הנושא שלהם מסתכם בכמה שקופיות במצגת פאוור פוינט, לפעמים אפילו שקופית אחת. הפוסט מסתיים ברשימת נקודות עיקריות - להבין אותן זה מספיק. הנקודה הבאה...","categories": ["צעדים ראשונים בג'אווה"],
        "tags": ["משתנים","טיפוסים","קאסטינג"],
        "url": "/2023/10/05/casting/",
        "teaser": null
      },{
        "title": "שלום עולם!",
        "excerpt":"שלום עולם! אני יובל דולב, מנטור בקבוצת Ladies FIRST #4319, בוגר קבוצת The Spikes #2212 FRC (מחזור 2016) ומנטור לשעבר בקבוצת The Red Pirates #4661. אני כאן כדי לעזור לקבוצות FRC ללמוד לתכנת רובוט לתחרות FRC בשפת Java - וגם ללמוד איתכם ביחד. התחלתי ללמד את הנושא כבר משנתי השנייה...","categories": ["כללי"],
        "tags": ["כללי"],
        "url": "/2024/04/25/hello-world/",
        "teaser": null
      },{
        "title": "מצגת מספר 0 - שלום עולם",
        "excerpt":"אני מנסה לצרף לאתר גם את המצגות שלי, שאני מציג איתן את החומר וההרצאות שאני מעביר. המצגת בפני עצמה לאו דווקא מספיקה ב-100% ללימוד עצמי, כי אני לרוב מדבר לידה, ואני לא שם במצגות את כל מה שאני הולך לומר אלא משהו שילווה את מה שאני אומר. הן כן נועדו...","categories": ["מצגות","צעדים ראשונים בג'אווה"],
        "tags": ["כללי","מצגות"],
        "url": "/2024/04/25/presentation-hello-world/",
        "teaser": null
      }]
